Revit 2027 API
HostObjectSubcomponentInfo Properties
The HostObjectSubcomponentInfo type exposes the following members.
Properties
Name | Description
AreaOfCurveLoop |  The area of the CurveLoop of the roof or floor slab.
Depth |  The depth of the roof or floor slab.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LoopFace |  The face of the loops of the roof or floor slab.
Top
See Also
Reference
HostObjectSubcomponentInfo Class
Autodesk.Revit.DB.IFC Namespace